# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#     Пример:
#     - [2, 3, 4, 5, 6] => [12, 15, 16];
#     - [2, 3, 5, 6] => [12, 15]


a = [2, 3, 4, 5, 6]
#a = [2, 3, 5, 6]
size = len(a)
b = []
for i in range(size):
    if i < size/2:
        b.append(int(a[i])*int(a[-i-1]))
print(b)
